{
  "name": "model",
  "layers": [
    {
      "class_name": "InputLayer",
      "config": {
        "batch_input_shape": [
          null,
          50
        ],
        "dtype": "float32",
        "sparse": false,
        "ragged": false,
        "name": "input_1"
      },
      "name": "input_1",
      "inbound_nodes": []
    },
    {
      "class_name": "Embedding",
      "config": {
        "name": "embedding",
        "trainable": false,
        "dtype": "float32",
        "batch_input_shape": [
          null,
          50
        ],
        "input_dim": 1200000,
        "output_dim": 200,
        "embeddings_initializer": {
          "class_name": "RandomUniform",
          "config": {
            "minval": -0.05,
            "maxval": 0.05,
            "seed": null
          }
        },
        "embeddings_regularizer": null,
        "activity_regularizer": null,
        "embeddings_constraint": null,
        "mask_zero": false,
        "input_length": 50
      },
      "name": "embedding",
      "inbound_nodes": [
        [
          [
            "input_1",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "SpatialDropout1D",
      "config": {
        "name": "spatial_dropout1d",
        "trainable": true,
        "dtype": "float32",
        "rate": 0.55,
        "noise_shape": null,
        "seed": null
      },
      "name": "spatial_dropout1d",
      "inbound_nodes": [
        [
          [
            "embedding",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "Bidirectional",
      "config": {
        "name": "bidirectional",
        "trainable": true,
        "dtype": "float32",
        "layer": {
          "class_name": "LSTM",
          "config": {
            "name": "lstm",
            "trainable": true,
            "dtype": "float32",
            "return_sequences": true,
            "return_state": false,
            "go_backwards": false,
            "stateful": false,
            "unroll": false,
            "time_major": false,
            "units": 32,
            "activation": "tanh",
            "recurrent_activation": "sigmoid",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "shared_object_id": 4
            },
            "recurrent_initializer": {
              "class_name": "Orthogonal",
              "config": {
                "gain": 1.0,
                "seed": null
              },
              "shared_object_id": 5
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {},
              "shared_object_id": 6
            },
            "unit_forget_bias": true,
            "kernel_regularizer": null,
            "recurrent_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "recurrent_constraint": null,
            "bias_constraint": null,
            "dropout": 0.55,
            "recurrent_dropout": 0.0,
            "implementation": 2
          }
        },
        "merge_mode": "concat"
      },
      "name": "bidirectional",
      "inbound_nodes": [
        [
          [
            "spatial_dropout1d",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "SpatialDropout1D",
      "config": {
        "name": "spatial_dropout1d_1",
        "trainable": true,
        "dtype": "float32",
        "rate": 0.55,
        "noise_shape": null,
        "seed": null
      },
      "name": "spatial_dropout1d_1",
      "inbound_nodes": [
        [
          [
            "bidirectional",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "Bidirectional",
      "config": {
        "name": "bidirectional_1",
        "trainable": true,
        "dtype": "float32",
        "layer": {
          "class_name": "LSTM",
          "config": {
            "name": "lstm_1",
            "trainable": true,
            "dtype": "float32",
            "return_sequences": true,
            "return_state": false,
            "go_backwards": false,
            "stateful": false,
            "unroll": false,
            "time_major": false,
            "units": 32,
            "activation": "tanh",
            "recurrent_activation": "sigmoid",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "shared_object_id": 11
            },
            "recurrent_initializer": {
              "class_name": "Orthogonal",
              "config": {
                "gain": 1.0,
                "seed": null
              },
              "shared_object_id": 12
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {},
              "shared_object_id": 13
            },
            "unit_forget_bias": true,
            "kernel_regularizer": null,
            "recurrent_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "recurrent_constraint": null,
            "bias_constraint": null,
            "dropout": 0.55,
            "recurrent_dropout": 0.0,
            "implementation": 2
          }
        },
        "merge_mode": "concat"
      },
      "name": "bidirectional_1",
      "inbound_nodes": [
        [
          [
            "spatial_dropout1d_1",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "SpatialDropout1D",
      "config": {
        "name": "spatial_dropout1d_7",
        "trainable": true,
        "dtype": "float32",
        "rate": 0.55,
        "noise_shape": null,
        "seed": null
      },
      "name": "spatial_dropout1d_7",
      "inbound_nodes": [
        [
          [
            "embedding",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "SpatialDropout1D",
      "config": {
        "name": "spatial_dropout1d_4",
        "trainable": true,
        "dtype": "float32",
        "rate": 0.55,
        "noise_shape": null,
        "seed": null
      },
      "name": "spatial_dropout1d_4",
      "inbound_nodes": [
        [
          [
            "bidirectional_1",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "Conv1D",
      "config": {
        "name": "conv1d_4",
        "trainable": true,
        "dtype": "float32",
        "filters": 128,
        "kernel_size": [
          4
        ],
        "strides": [
          1
        ],
        "padding": "valid",
        "data_format": "channels_last",
        "dilation_rate": [
          1
        ],
        "groups": 1,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "name": "conv1d_4",
      "inbound_nodes": [
        [
          [
            "spatial_dropout1d_7",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "Conv1D",
      "config": {
        "name": "conv1d",
        "trainable": true,
        "dtype": "float32",
        "filters": 128,
        "kernel_size": [
          4
        ],
        "strides": [
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1
        ],
        "groups": 1,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "name": "conv1d",
      "inbound_nodes": [
        [
          [
            "spatial_dropout1d_1",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "Conv1D",
      "config": {
        "name": "conv1d_2",
        "trainable": true,
        "dtype": "float32",
        "filters": 128,
        "kernel_size": [
          4
        ],
        "strides": [
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1
        ],
        "groups": 1,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "name": "conv1d_2",
      "inbound_nodes": [
        [
          [
            "spatial_dropout1d_4",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "MaxPooling1D",
      "config": {
        "name": "max_pooling1d_4",
        "trainable": true,
        "dtype": "float32",
        "strides": [
          2
        ],
        "pool_size": [
          2
        ],
        "padding": "valid",
        "data_format": "channels_last"
      },
      "name": "max_pooling1d_4",
      "inbound_nodes": [
        [
          [
            "conv1d_4",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "MaxPooling1D",
      "config": {
        "name": "max_pooling1d",
        "trainable": true,
        "dtype": "float32",
        "strides": [
          2
        ],
        "pool_size": [
          2
        ],
        "padding": "valid",
        "data_format": "channels_last"
      },
      "name": "max_pooling1d",
      "inbound_nodes": [
        [
          [
            "conv1d",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "MaxPooling1D",
      "config": {
        "name": "max_pooling1d_2",
        "trainable": true,
        "dtype": "float32",
        "strides": [
          2
        ],
        "pool_size": [
          2
        ],
        "padding": "valid",
        "data_format": "channels_last"
      },
      "name": "max_pooling1d_2",
      "inbound_nodes": [
        [
          [
            "conv1d_2",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "SpatialDropout1D",
      "config": {
        "name": "spatial_dropout1d_9",
        "trainable": true,
        "dtype": "float32",
        "rate": 0.55,
        "noise_shape": null,
        "seed": null
      },
      "name": "spatial_dropout1d_9",
      "inbound_nodes": [
        [
          [
            "max_pooling1d_4",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "SpatialDropout1D",
      "config": {
        "name": "spatial_dropout1d_2",
        "trainable": true,
        "dtype": "float32",
        "rate": 0.55,
        "noise_shape": null,
        "seed": null
      },
      "name": "spatial_dropout1d_2",
      "inbound_nodes": [
        [
          [
            "max_pooling1d",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "SpatialDropout1D",
      "config": {
        "name": "spatial_dropout1d_5",
        "trainable": true,
        "dtype": "float32",
        "rate": 0.55,
        "noise_shape": null,
        "seed": null
      },
      "name": "spatial_dropout1d_5",
      "inbound_nodes": [
        [
          [
            "max_pooling1d_2",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "Conv1D",
      "config": {
        "name": "conv1d_5",
        "trainable": true,
        "dtype": "float32",
        "filters": 64,
        "kernel_size": [
          4
        ],
        "strides": [
          1
        ],
        "padding": "valid",
        "data_format": "channels_last",
        "dilation_rate": [
          1
        ],
        "groups": 1,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "name": "conv1d_5",
      "inbound_nodes": [
        [
          [
            "spatial_dropout1d_9",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "Conv1D",
      "config": {
        "name": "conv1d_1",
        "trainable": true,
        "dtype": "float32",
        "filters": 128,
        "kernel_size": [
          4
        ],
        "strides": [
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1
        ],
        "groups": 1,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "name": "conv1d_1",
      "inbound_nodes": [
        [
          [
            "spatial_dropout1d_2",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "Conv1D",
      "config": {
        "name": "conv1d_3",
        "trainable": true,
        "dtype": "float32",
        "filters": 128,
        "kernel_size": [
          4
        ],
        "strides": [
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1
        ],
        "groups": 1,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "name": "conv1d_3",
      "inbound_nodes": [
        [
          [
            "spatial_dropout1d_5",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "MaxPooling1D",
      "config": {
        "name": "max_pooling1d_5",
        "trainable": true,
        "dtype": "float32",
        "strides": [
          2
        ],
        "pool_size": [
          2
        ],
        "padding": "valid",
        "data_format": "channels_last"
      },
      "name": "max_pooling1d_5",
      "inbound_nodes": [
        [
          [
            "conv1d_5",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "MaxPooling1D",
      "config": {
        "name": "max_pooling1d_1",
        "trainable": true,
        "dtype": "float32",
        "strides": [
          2
        ],
        "pool_size": [
          2
        ],
        "padding": "valid",
        "data_format": "channels_last"
      },
      "name": "max_pooling1d_1",
      "inbound_nodes": [
        [
          [
            "conv1d_1",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "MaxPooling1D",
      "config": {
        "name": "max_pooling1d_3",
        "trainable": true,
        "dtype": "float32",
        "strides": [
          2
        ],
        "pool_size": [
          2
        ],
        "padding": "valid",
        "data_format": "channels_last"
      },
      "name": "max_pooling1d_3",
      "inbound_nodes": [
        [
          [
            "conv1d_3",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "Bidirectional",
      "config": {
        "name": "bidirectional_3",
        "trainable": true,
        "dtype": "float32",
        "layer": {
          "class_name": "LSTM",
          "config": {
            "name": "lstm_3",
            "trainable": true,
            "dtype": "float32",
            "return_sequences": true,
            "return_state": false,
            "go_backwards": false,
            "stateful": false,
            "unroll": false,
            "time_major": false,
            "units": 128,
            "activation": "tanh",
            "recurrent_activation": "sigmoid",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "shared_object_id": 46
            },
            "recurrent_initializer": {
              "class_name": "Orthogonal",
              "config": {
                "gain": 1.0,
                "seed": null
              },
              "shared_object_id": 47
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {},
              "shared_object_id": 48
            },
            "unit_forget_bias": true,
            "kernel_regularizer": null,
            "recurrent_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "recurrent_constraint": null,
            "bias_constraint": null,
            "dropout": 0.55,
            "recurrent_dropout": 0.0,
            "implementation": 2
          }
        },
        "merge_mode": "concat"
      },
      "name": "bidirectional_3",
      "inbound_nodes": [
        [
          [
            "conv1d_4",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "Bidirectional",
      "config": {
        "name": "bidirectional_5",
        "trainable": true,
        "dtype": "float32",
        "layer": {
          "class_name": "LSTM",
          "config": {
            "name": "lstm_5",
            "trainable": true,
            "dtype": "float32",
            "return_sequences": true,
            "return_state": false,
            "go_backwards": false,
            "stateful": false,
            "unroll": false,
            "time_major": false,
            "units": 64,
            "activation": "tanh",
            "recurrent_activation": "sigmoid",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "shared_object_id": 52
            },
            "recurrent_initializer": {
              "class_name": "Orthogonal",
              "config": {
                "gain": 1.0,
                "seed": null
              },
              "shared_object_id": 53
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {},
              "shared_object_id": 54
            },
            "unit_forget_bias": true,
            "kernel_regularizer": null,
            "recurrent_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "recurrent_constraint": null,
            "bias_constraint": null,
            "dropout": 0.55,
            "recurrent_dropout": 0.0,
            "implementation": 2
          }
        },
        "merge_mode": "concat"
      },
      "name": "bidirectional_5",
      "inbound_nodes": [
        [
          [
            "conv1d_5",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "SpatialDropout1D",
      "config": {
        "name": "spatial_dropout1d_11",
        "trainable": true,
        "dtype": "float32",
        "rate": 0.55,
        "noise_shape": null,
        "seed": null
      },
      "name": "spatial_dropout1d_11",
      "inbound_nodes": [
        [
          [
            "max_pooling1d_5",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "SpatialDropout1D",
      "config": {
        "name": "spatial_dropout1d_3",
        "trainable": true,
        "dtype": "float32",
        "rate": 0.55,
        "noise_shape": null,
        "seed": null
      },
      "name": "spatial_dropout1d_3",
      "inbound_nodes": [
        [
          [
            "max_pooling1d_1",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "SpatialDropout1D",
      "config": {
        "name": "spatial_dropout1d_6",
        "trainable": true,
        "dtype": "float32",
        "rate": 0.55,
        "noise_shape": null,
        "seed": null
      },
      "name": "spatial_dropout1d_6",
      "inbound_nodes": [
        [
          [
            "max_pooling1d_3",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "Bidirectional",
      "config": {
        "name": "bidirectional_2",
        "trainable": true,
        "dtype": "float32",
        "layer": {
          "class_name": "LSTM",
          "config": {
            "name": "lstm_2",
            "trainable": true,
            "dtype": "float32",
            "return_sequences": false,
            "return_state": false,
            "go_backwards": false,
            "stateful": false,
            "unroll": false,
            "time_major": false,
            "units": 64,
            "activation": "tanh",
            "recurrent_activation": "sigmoid",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "shared_object_id": 61
            },
            "recurrent_initializer": {
              "class_name": "Orthogonal",
              "config": {
                "gain": 1.0,
                "seed": null
              },
              "shared_object_id": 62
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {},
              "shared_object_id": 63
            },
            "unit_forget_bias": true,
            "kernel_regularizer": null,
            "recurrent_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "recurrent_constraint": null,
            "bias_constraint": null,
            "dropout": 0.55,
            "recurrent_dropout": 0.0,
            "implementation": 2
          }
        },
        "merge_mode": "concat"
      },
      "name": "bidirectional_2",
      "inbound_nodes": [
        [
          [
            "spatial_dropout1d_4",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "SpatialDropout1D",
      "config": {
        "name": "spatial_dropout1d_8",
        "trainable": true,
        "dtype": "float32",
        "rate": 0.55,
        "noise_shape": null,
        "seed": null
      },
      "name": "spatial_dropout1d_8",
      "inbound_nodes": [
        [
          [
            "bidirectional_3",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "SpatialDropout1D",
      "config": {
        "name": "spatial_dropout1d_10",
        "trainable": true,
        "dtype": "float32",
        "rate": 0.55,
        "noise_shape": null,
        "seed": null
      },
      "name": "spatial_dropout1d_10",
      "inbound_nodes": [
        [
          [
            "bidirectional_5",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "Conv1D",
      "config": {
        "name": "conv1d_6",
        "trainable": true,
        "dtype": "float32",
        "filters": 128,
        "kernel_size": [
          4
        ],
        "strides": [
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1
        ],
        "groups": 1,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "name": "conv1d_6",
      "inbound_nodes": [
        [
          [
            "spatial_dropout1d_11",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "GlobalMaxPooling1D",
      "config": {
        "name": "global_max_pooling1d",
        "trainable": true,
        "dtype": "float32",
        "data_format": "channels_last",
        "keepdims": false
      },
      "name": "global_max_pooling1d",
      "inbound_nodes": [
        [
          [
            "spatial_dropout1d_3",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "GlobalMaxPooling1D",
      "config": {
        "name": "global_max_pooling1d_1",
        "trainable": true,
        "dtype": "float32",
        "data_format": "channels_last",
        "keepdims": false
      },
      "name": "global_max_pooling1d_1",
      "inbound_nodes": [
        [
          [
            "spatial_dropout1d_6",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "Dropout",
      "config": {
        "name": "dropout",
        "trainable": true,
        "dtype": "float32",
        "rate": 0.55,
        "noise_shape": null,
        "seed": null
      },
      "name": "dropout",
      "inbound_nodes": [
        [
          [
            "bidirectional_2",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "Bidirectional",
      "config": {
        "name": "bidirectional_4",
        "trainable": true,
        "dtype": "float32",
        "layer": {
          "class_name": "LSTM",
          "config": {
            "name": "lstm_4",
            "trainable": true,
            "dtype": "float32",
            "return_sequences": false,
            "return_state": false,
            "go_backwards": false,
            "stateful": false,
            "unroll": false,
            "time_major": false,
            "units": 64,
            "activation": "tanh",
            "recurrent_activation": "sigmoid",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "shared_object_id": 75
            },
            "recurrent_initializer": {
              "class_name": "Orthogonal",
              "config": {
                "gain": 1.0,
                "seed": null
              },
              "shared_object_id": 76
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {},
              "shared_object_id": 77
            },
            "unit_forget_bias": true,
            "kernel_regularizer": null,
            "recurrent_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "recurrent_constraint": null,
            "bias_constraint": null,
            "dropout": 0.55,
            "recurrent_dropout": 0.0,
            "implementation": 2
          }
        },
        "merge_mode": "concat"
      },
      "name": "bidirectional_4",
      "inbound_nodes": [
        [
          [
            "spatial_dropout1d_8",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "Bidirectional",
      "config": {
        "name": "bidirectional_6",
        "trainable": true,
        "dtype": "float32",
        "layer": {
          "class_name": "LSTM",
          "config": {
            "name": "lstm_6",
            "trainable": true,
            "dtype": "float32",
            "return_sequences": false,
            "return_state": false,
            "go_backwards": false,
            "stateful": false,
            "unroll": false,
            "time_major": false,
            "units": 64,
            "activation": "tanh",
            "recurrent_activation": "sigmoid",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "shared_object_id": 81
            },
            "recurrent_initializer": {
              "class_name": "Orthogonal",
              "config": {
                "gain": 1.0,
                "seed": null
              },
              "shared_object_id": 82
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {},
              "shared_object_id": 83
            },
            "unit_forget_bias": true,
            "kernel_regularizer": null,
            "recurrent_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "recurrent_constraint": null,
            "bias_constraint": null,
            "dropout": 0.55,
            "recurrent_dropout": 0.0,
            "implementation": 2
          }
        },
        "merge_mode": "concat"
      },
      "name": "bidirectional_6",
      "inbound_nodes": [
        [
          [
            "spatial_dropout1d_10",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "GlobalMaxPooling1D",
      "config": {
        "name": "global_max_pooling1d_2",
        "trainable": true,
        "dtype": "float32",
        "data_format": "channels_last",
        "keepdims": false
      },
      "name": "global_max_pooling1d_2",
      "inbound_nodes": [
        [
          [
            "conv1d_6",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "Add",
      "config": {
        "name": "add",
        "trainable": true,
        "dtype": "float32"
      },
      "name": "add",
      "inbound_nodes": [
        [
          [
            "global_max_pooling1d",
            0,
            0,
            {}
          ],
          [
            "global_max_pooling1d_1",
            0,
            0,
            {}
          ],
          [
            "dropout",
            0,
            0,
            {}
          ],
          [
            "bidirectional_4",
            0,
            0,
            {}
          ],
          [
            "bidirectional_6",
            0,
            0,
            {}
          ],
          [
            "global_max_pooling1d_2",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "Dropout",
      "config": {
        "name": "dropout_1",
        "trainable": true,
        "dtype": "float32",
        "rate": 0.55,
        "noise_shape": null,
        "seed": null
      },
      "name": "dropout_1",
      "inbound_nodes": [
        [
          [
            "add",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "Dense",
      "config": {
        "name": "dense",
        "trainable": true,
        "dtype": "float32",
        "units": 3,
        "activation": "softmax",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "name": "dense",
      "inbound_nodes": [
        [
          [
            "dropout_1",
            0,
            0,
            {}
          ]
        ]
      ]
    }
  ],
  "input_layers": [
    [
      "input_1",
      0,
      0
    ]
  ],
  "output_layers": [
    [
      "dense",
      0,
      0
    ]
  ]
}
