{
  "name": "model",
  "layers": [
    {
      "class_name": "InputLayer",
      "config": {
        "batch_input_shape": [
          null,
          28,
          28,
          1
        ],
        "dtype": "float32",
        "sparse": false,
        "ragged": false,
        "name": "input_1"
      },
      "name": "input_1",
      "inbound_nodes": []
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization",
        "trainable": true,
        "dtype": "float32",
        "axis": [
          3
        ],
        "momentum": 0.99,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null
      },
      "name": "batch_normalization",
      "inbound_nodes": [
        [
          [
            "input_1",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "conv2d",
        "trainable": true,
        "dtype": "float32",
        "filters": 32,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "valid",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "groups": 1,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "name": "conv2d",
      "inbound_nodes": [
        [
          [
            "batch_normalization",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "SeparableConv2D",
      "config": {
        "name": "separable_conv2d",
        "trainable": true,
        "dtype": "float32",
        "filters": 32,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "valid",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "groups": 1,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {},
          "shared_object_id": 11
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null,
        "depth_multiplier": 1,
        "depthwise_initializer": {
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          }
        },
        "pointwise_initializer": {
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          }
        },
        "depthwise_regularizer": null,
        "pointwise_regularizer": null,
        "depthwise_constraint": null,
        "pointwise_constraint": null
      },
      "name": "separable_conv2d",
      "inbound_nodes": [
        [
          [
            "batch_normalization",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "LocallyConnected2D",
      "config": {
        "name": "locally_connected2d",
        "trainable": true,
        "dtype": "float32",
        "filters": 32,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "valid",
        "data_format": "channels_last",
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null,
        "implementation": 1
      },
      "name": "locally_connected2d",
      "inbound_nodes": [
        [
          [
            "batch_normalization",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "MaxPooling2D",
      "config": {
        "name": "max_pooling2d",
        "trainable": true,
        "dtype": "float32",
        "pool_size": [
          2,
          2
        ],
        "padding": "valid",
        "strides": [
          2,
          2
        ],
        "data_format": "channels_last"
      },
      "name": "max_pooling2d",
      "inbound_nodes": [
        [
          [
            "conv2d",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "MaxPooling2D",
      "config": {
        "name": "max_pooling2d_3",
        "trainable": true,
        "dtype": "float32",
        "pool_size": [
          2,
          2
        ],
        "padding": "valid",
        "strides": [
          2,
          2
        ],
        "data_format": "channels_last"
      },
      "name": "max_pooling2d_3",
      "inbound_nodes": [
        [
          [
            "separable_conv2d",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "MaxPooling2D",
      "config": {
        "name": "max_pooling2d_6",
        "trainable": true,
        "dtype": "float32",
        "pool_size": [
          2,
          2
        ],
        "padding": "valid",
        "strides": [
          2,
          2
        ],
        "data_format": "channels_last"
      },
      "name": "max_pooling2d_6",
      "inbound_nodes": [
        [
          [
            "locally_connected2d",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "SpatialDropout2D",
      "config": {
        "name": "spatial_dropout2d",
        "trainable": true,
        "dtype": "float32",
        "rate": 0.25,
        "noise_shape": null,
        "seed": null
      },
      "name": "spatial_dropout2d",
      "inbound_nodes": [
        [
          [
            "max_pooling2d",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "SpatialDropout2D",
      "config": {
        "name": "spatial_dropout2d_3",
        "trainable": true,
        "dtype": "float32",
        "rate": 0.25,
        "noise_shape": null,
        "seed": null
      },
      "name": "spatial_dropout2d_3",
      "inbound_nodes": [
        [
          [
            "max_pooling2d_3",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "SpatialDropout2D",
      "config": {
        "name": "spatial_dropout2d_6",
        "trainable": true,
        "dtype": "float32",
        "rate": 0.25,
        "noise_shape": null,
        "seed": null
      },
      "name": "spatial_dropout2d_6",
      "inbound_nodes": [
        [
          [
            "max_pooling2d_6",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "conv2d_1",
        "trainable": true,
        "dtype": "float32",
        "filters": 64,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "valid",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "groups": 1,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "name": "conv2d_1",
      "inbound_nodes": [
        [
          [
            "spatial_dropout2d",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "SeparableConv2D",
      "config": {
        "name": "separable_conv2d_1",
        "trainable": true,
        "dtype": "float32",
        "filters": 64,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "valid",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "groups": 1,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {},
          "shared_object_id": 28
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null,
        "depth_multiplier": 1,
        "depthwise_initializer": {
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          }
        },
        "pointwise_initializer": {
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          }
        },
        "depthwise_regularizer": null,
        "pointwise_regularizer": null,
        "depthwise_constraint": null,
        "pointwise_constraint": null
      },
      "name": "separable_conv2d_1",
      "inbound_nodes": [
        [
          [
            "spatial_dropout2d_3",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "LocallyConnected2D",
      "config": {
        "name": "locally_connected2d_1",
        "trainable": true,
        "dtype": "float32",
        "filters": 64,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "valid",
        "data_format": "channels_last",
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null,
        "implementation": 1
      },
      "name": "locally_connected2d_1",
      "inbound_nodes": [
        [
          [
            "spatial_dropout2d_6",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "Flatten",
      "config": {
        "name": "flatten_3",
        "trainable": true,
        "dtype": "float32",
        "data_format": "channels_last"
      },
      "name": "flatten_3",
      "inbound_nodes": [
        [
          [
            "batch_normalization",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "MaxPooling2D",
      "config": {
        "name": "max_pooling2d_1",
        "trainable": true,
        "dtype": "float32",
        "pool_size": [
          2,
          2
        ],
        "padding": "valid",
        "strides": [
          2,
          2
        ],
        "data_format": "channels_last"
      },
      "name": "max_pooling2d_1",
      "inbound_nodes": [
        [
          [
            "conv2d_1",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "MaxPooling2D",
      "config": {
        "name": "max_pooling2d_4",
        "trainable": true,
        "dtype": "float32",
        "pool_size": [
          2,
          2
        ],
        "padding": "valid",
        "strides": [
          2,
          2
        ],
        "data_format": "channels_last"
      },
      "name": "max_pooling2d_4",
      "inbound_nodes": [
        [
          [
            "separable_conv2d_1",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "MaxPooling2D",
      "config": {
        "name": "max_pooling2d_7",
        "trainable": true,
        "dtype": "float32",
        "pool_size": [
          2,
          2
        ],
        "padding": "valid",
        "strides": [
          2,
          2
        ],
        "data_format": "channels_last"
      },
      "name": "max_pooling2d_7",
      "inbound_nodes": [
        [
          [
            "locally_connected2d_1",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "Dense",
      "config": {
        "name": "dense",
        "trainable": true,
        "dtype": "float32",
        "units": 512,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "name": "dense",
      "inbound_nodes": [
        [
          [
            "flatten_3",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "SpatialDropout2D",
      "config": {
        "name": "spatial_dropout2d_1",
        "trainable": true,
        "dtype": "float32",
        "rate": 0.25,
        "noise_shape": null,
        "seed": null
      },
      "name": "spatial_dropout2d_1",
      "inbound_nodes": [
        [
          [
            "max_pooling2d_1",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "SpatialDropout2D",
      "config": {
        "name": "spatial_dropout2d_4",
        "trainable": true,
        "dtype": "float32",
        "rate": 0.25,
        "noise_shape": null,
        "seed": null
      },
      "name": "spatial_dropout2d_4",
      "inbound_nodes": [
        [
          [
            "max_pooling2d_4",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "SpatialDropout2D",
      "config": {
        "name": "spatial_dropout2d_7",
        "trainable": true,
        "dtype": "float32",
        "rate": 0.25,
        "noise_shape": null,
        "seed": null
      },
      "name": "spatial_dropout2d_7",
      "inbound_nodes": [
        [
          [
            "max_pooling2d_7",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "Dropout",
      "config": {
        "name": "dropout",
        "trainable": true,
        "dtype": "float32",
        "rate": 0.25,
        "noise_shape": null,
        "seed": null
      },
      "name": "dropout",
      "inbound_nodes": [
        [
          [
            "dense",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "conv2d_2",
        "trainable": true,
        "dtype": "float32",
        "filters": 128,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "valid",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "groups": 1,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "name": "conv2d_2",
      "inbound_nodes": [
        [
          [
            "spatial_dropout2d_1",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "SeparableConv2D",
      "config": {
        "name": "separable_conv2d_2",
        "trainable": true,
        "dtype": "float32",
        "filters": 128,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "valid",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "groups": 1,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {},
          "shared_object_id": 50
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null,
        "depth_multiplier": 1,
        "depthwise_initializer": {
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          }
        },
        "pointwise_initializer": {
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          }
        },
        "depthwise_regularizer": null,
        "pointwise_regularizer": null,
        "depthwise_constraint": null,
        "pointwise_constraint": null
      },
      "name": "separable_conv2d_2",
      "inbound_nodes": [
        [
          [
            "spatial_dropout2d_4",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "LocallyConnected2D",
      "config": {
        "name": "locally_connected2d_2",
        "trainable": true,
        "dtype": "float32",
        "filters": 128,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "valid",
        "data_format": "channels_last",
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null,
        "implementation": 1
      },
      "name": "locally_connected2d_2",
      "inbound_nodes": [
        [
          [
            "spatial_dropout2d_7",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "Dense",
      "config": {
        "name": "dense_1",
        "trainable": true,
        "dtype": "float32",
        "units": 256,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "name": "dense_1",
      "inbound_nodes": [
        [
          [
            "dropout",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "MaxPooling2D",
      "config": {
        "name": "max_pooling2d_2",
        "trainable": true,
        "dtype": "float32",
        "pool_size": [
          2,
          2
        ],
        "padding": "valid",
        "strides": [
          2,
          2
        ],
        "data_format": "channels_last"
      },
      "name": "max_pooling2d_2",
      "inbound_nodes": [
        [
          [
            "conv2d_2",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "MaxPooling2D",
      "config": {
        "name": "max_pooling2d_5",
        "trainable": true,
        "dtype": "float32",
        "pool_size": [
          2,
          2
        ],
        "padding": "valid",
        "strides": [
          2,
          2
        ],
        "data_format": "channels_last"
      },
      "name": "max_pooling2d_5",
      "inbound_nodes": [
        [
          [
            "separable_conv2d_2",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "MaxPooling2D",
      "config": {
        "name": "max_pooling2d_8",
        "trainable": true,
        "dtype": "float32",
        "pool_size": [
          2,
          2
        ],
        "padding": "valid",
        "strides": [
          2,
          2
        ],
        "data_format": "channels_last"
      },
      "name": "max_pooling2d_8",
      "inbound_nodes": [
        [
          [
            "locally_connected2d_2",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "Dropout",
      "config": {
        "name": "dropout_1",
        "trainable": true,
        "dtype": "float32",
        "rate": 0.25,
        "noise_shape": null,
        "seed": null
      },
      "name": "dropout_1",
      "inbound_nodes": [
        [
          [
            "dense_1",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "SpatialDropout2D",
      "config": {
        "name": "spatial_dropout2d_2",
        "trainable": true,
        "dtype": "float32",
        "rate": 0.25,
        "noise_shape": null,
        "seed": null
      },
      "name": "spatial_dropout2d_2",
      "inbound_nodes": [
        [
          [
            "max_pooling2d_2",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "SpatialDropout2D",
      "config": {
        "name": "spatial_dropout2d_5",
        "trainable": true,
        "dtype": "float32",
        "rate": 0.25,
        "noise_shape": null,
        "seed": null
      },
      "name": "spatial_dropout2d_5",
      "inbound_nodes": [
        [
          [
            "max_pooling2d_5",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "SpatialDropout2D",
      "config": {
        "name": "spatial_dropout2d_8",
        "trainable": true,
        "dtype": "float32",
        "rate": 0.25,
        "noise_shape": null,
        "seed": null
      },
      "name": "spatial_dropout2d_8",
      "inbound_nodes": [
        [
          [
            "max_pooling2d_8",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "Dense",
      "config": {
        "name": "dense_2",
        "trainable": true,
        "dtype": "float32",
        "units": 128,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "name": "dense_2",
      "inbound_nodes": [
        [
          [
            "dropout_1",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "Flatten",
      "config": {
        "name": "flatten",
        "trainable": true,
        "dtype": "float32",
        "data_format": "channels_last"
      },
      "name": "flatten",
      "inbound_nodes": [
        [
          [
            "spatial_dropout2d_2",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "Flatten",
      "config": {
        "name": "flatten_1",
        "trainable": true,
        "dtype": "float32",
        "data_format": "channels_last"
      },
      "name": "flatten_1",
      "inbound_nodes": [
        [
          [
            "spatial_dropout2d_5",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "Flatten",
      "config": {
        "name": "flatten_2",
        "trainable": true,
        "dtype": "float32",
        "data_format": "channels_last"
      },
      "name": "flatten_2",
      "inbound_nodes": [
        [
          [
            "spatial_dropout2d_8",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "Dropout",
      "config": {
        "name": "dropout_2",
        "trainable": true,
        "dtype": "float32",
        "rate": 0.25,
        "noise_shape": null,
        "seed": null
      },
      "name": "dropout_2",
      "inbound_nodes": [
        [
          [
            "dense_2",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "Add",
      "config": {
        "name": "add",
        "trainable": true,
        "dtype": "float32"
      },
      "name": "add",
      "inbound_nodes": [
        [
          [
            "flatten",
            0,
            0,
            {}
          ],
          [
            "flatten_1",
            0,
            0,
            {}
          ],
          [
            "flatten_2",
            0,
            0,
            {}
          ],
          [
            "dropout_2",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "class_name": "Dense",
      "config": {
        "name": "dense_3",
        "trainable": true,
        "dtype": "float32",
        "units": 10,
        "activation": "softmax",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "name": "dense_3",
      "inbound_nodes": [
        [
          [
            "add",
            0,
            0,
            {}
          ]
        ]
      ]
    }
  ],
  "input_layers": [
    [
      "input_1",
      0,
      0
    ]
  ],
  "output_layers": [
    [
      "dense_3",
      0,
      0
    ]
  ]
}